# AlwaysZeroLength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AlwaysZeroLength Property
ParameterTypeId Class See Also
---
"Base Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AlwaysZeroLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AlwaysZeroLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AlwaysZeroLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace